&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	УстановитьДоступностьЭлементовФормы();
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьЭлементовФормы()
	Если РольДоступна("ПолныеПрава") Тогда
		Элементы.УслугаОказана.ТолькоПросмотр = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ДатаЗаписи = Объект.ДатаОкончанияЗаписи Тогда
		Объект.ДатаОкончанияЗаписи = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаписиПриИзменении(Элемент)
	ДляИзмененияДатыОкончанияЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	ДляИзмененияДатыОкончанияЗаписи();
КонецПроцедуры

&НаКлиенте
Процедура УслугиУслугаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ЗначениеЗаполнено(СтрокаТЧ.Услуга) Тогда
		СтрокаТЧ.Цена = РаботаСЦенами.ПолучитьЦенуПродажиНаДату(СтрокаТЧ.Услуга,, Объект.Дата);
	Иначе
		СтрокаТЧ.Цена = 0;
	КонецЕсли;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСТрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные; 
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСТрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСТрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ДляИзмененияДатыОкончанияЗаписи()
	СтрокаТЧ = Элементы.Услуги.ТекущиеДанные;
	Если ПолучитьВремяВыполненияУслуг() <> Null Тогда
		Если СтрокаТЧ.Количество > 0 Тогда
			Объект.ДатаОкончанияЗаписи = Объект.ДатаЗаписи + (ПолучитьВремяВыполненияУслуг() * 60) * СтрокаТЧ.Количество;
		ИначеЕсли СтрокаТЧ.Количество = 0 Тогда
			Объект.ДатаОкончанияЗаписи = Объект.ДатаЗаписи + (ПолучитьВремяВыполненияУслуг() * 60) * 0;
		КонецЕсли;
	ИначеЕсли Объект.Услуги.Количество() = 0 Тогда
		Объект.ДатаОкончанияЗаписи = '00010101';
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьВремяВыполненияУслуг()
	ТЧУслуги = Объект.Услуги.Выгрузить(,"Услуга");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТЧУслуги.Услуга КАК Услуга
	|ПОМЕСТИТЬ ВТ_Номенклатура
	|ИЗ
	|	&ТЧУслуги КАК ТЧУслуги
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Ном.ДлительностьУслуги) КАК ДлительностьУслуги
	|ИЗ
	|	ВТ_Номенклатура КАК ВТ_Номенклатура
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ВТ_Номенклатура.Услуга = Ном.Ссылка";
	Запрос.УстановитьПараметр("ТЧУслуги", ТЧУслуги);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 0;
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.ДлительностьУслуги;
КонецФункции


