&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		ЭтоФизлицо = Истина;
	Иначе
		ЭтоФизлицо = Ложь;
	КонецЕсли;
	//Проверка ИНН на заполнение
	ИНН = Объект.ИНН;
	Если СтрДлина(ИНН) <> ?(ЭтоФизлицо, 12, 10) Тогда
		СообщениеОНевозможностиЗаписи = "Неверное количество символов в реквизите ИНН!" + Символы.ПС
		+ "Текущее количество символов: " + СтрДлина(ИНН) + Символы.ПС
		+ "Требуемое количество символов для " + ?(ЭтоФизлицо, "Физлица: 12", "Юрлица: 10");
		Сообщить(СообщениеОНевозможностиЗаписи);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//Проверка ИНН на недопустимые символы
	Результат = Истина;
	Для а = 1 ПО СтрДлина(ИНН) Цикл
		Если Найти("0123456789", Сред(ИНН,а,1)) = 0 Тогда
			Результат = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ Результат Тогда
		СообщениеОНевозможностиЗаписи = "Недопустимый символ в реквизите ИНН!";
		Сообщить(СообщениеОНевозможностиЗаписи);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") И ЗначениеЗаполнено(Объект.ГлавныйБухгалтер) Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ТекстВопроса = "После изменения типа организации, будет очищен реквизит «Главный бухгалтер», продолжить?";
		ПоказатьВопрос(Оповещение, ТекстВопроса, Режим);
	ИначеЕсли Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	ИначеЕсли Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель");
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Объект.ГлавныйБухгалтер = Неопределено;
	Иначе
		Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо");
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры